openFoam/heatTransfer/chtMultiRegionFoam/adjacentSolid/0/solid1/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid1";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    minX
    {
        type            calculated;
        value           uniform 0.01;
    }
    maxX
    {
        type            calculated;
        value           uniform 0.01;
    }
    minY
    {
        type            calculated;
        value           uniform 0.01;
    }
    maxY
    {
        type            calculated;
        value           uniform 0.01;
    }
    minZ
    {
        type            calculated;
        value           uniform 0.01;
    }
    solid1_to_solid2
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
