openFoam/heatTransfer/chtMultiRegionFoam/adjacentSolid/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	( 0.0  0.0  0.0)
	( 1.0  0.0  0.0)
	( 1.0  0.5  0.0)
	( 0.0  0.5  0.0)
 
	( 0.0  0.0  0.5)
	( 1.0  0.0  0.5)
	( 1.0  0.5  0.5)
	( 0.0  0.5  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 5 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    minX
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
	maxX  
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    minY
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    maxY
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    minZ
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    maxZ
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
