openFoam/heatTransfer/chtMultiRegionFoam/adjacentSolid/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // solid1
    {
        name    solid1CellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-100 -100 -100)(100 100 0.24999);
        }
    }
    {
        name    solid1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set solid1CellSet;
        }
    }

    // solid2 is all the other cells
    {
        name    solid2CellSet;
        type    cellSet;
        action  new;
        source  cellToCell;
        sourceInfo
        {
            set solid1CellSet;
        }
    }
    {
        name    solid2CellSet;
        type    cellSet;
        action  invert;
    }
    {
        name    solid2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set solid2CellSet;
        }
    }
);

// ************************************************************************* //
